static/html/articles/Browser-and-Server-Sync.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-11-07 Mon 15:59 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Browser and Server Sync (Polling, Comet, Long Polling, WebSocket)</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Junjia Ni">
<meta  name="keywords" content="polling,commet,long-polling,websocket,nodejs,javascript,coffeescript,python">
<link rel="stylesheet" type="text/css" href="/static/article.css"><!--[if lt IE 9]>
<![endif]-->
</head>
<body>
<div id="content">
<header>
<h1 class="title">Browser and Server Sync (Polling, Comet, Long Polling, WebSocket)</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 前言</a></li>
<li><a href="#orgheadline4">2. 环境的搭建</a>
<ul>
<li><a href="#orgheadline2">2.1. Flask</a></li>
<li><a href="#orgheadline3">2.2. Nodejs</a></li>
</ul>
</li>
<li><a href="#orgheadline5">3. Polling</a></li>
<li><a href="#orgheadline6">4. Comet</a></li>
<li><a href="#orgheadline7">5. Long Polling</a></li>
<li><a href="#orgheadline8">6. WebSocket</a></li>
<li><a href="#orgheadline9">7. Socket.IO</a></li>
<li><a href="#orgheadline10">8. 后记</a></li>
</ul>
</div>
</nav>


<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
这只是一篇简单介绍浏览器与服务器之间的实时数据交换的方法。
在客户端使用的是 <a href="http://coffeescript.org/">coffeescript</a> ，接触下来感觉这种语法还是不错的，
然后在学习的过程中，貌似coffeescript借鉴了许多 <a href="http://www.ruby-lang.org/en/">Ruby</a> 的语法，
所以接下来我准备去看看Ruby，当然这个是题外话啦。
一旦接受了coffeescript这种设定，还是很带感的。
</p>

<p>
然后服务器用的是 <a href="http://www.python.org/">python</a> 的 <a href="http://flask.pocoo.org/">Flask</a> 这一WEB框架以及 <a href="http://nodejs.org/">nodejs</a>
</p>

<p>
主要参考的是：<a href="http://www.josephj.com/entry.php?id=358">Browser 與 Server 持續同步的作法介紹 (Polling, Comet, Long Polling, WebSocket)</a>
</p>
</div>
</div>

<div id="outline-container-orgheadline4" class="outline-2">
<h2 id="orgheadline4"><span class="section-number-2">2</span> 环境的搭建</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Flask</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>Install
安装步骤，请移步 <a href="http://flask.pocoo.org/docs/installation/#installation">这里</a> ，这里是官方的安装方式，在这里我接触到了python的虚拟环境。
感觉用这个virtualenv的确不错，然后我找到了一篇介绍这种的文章：<a href="https://virtualenv-chinese-docs.readthedocs.org/en/latest/">virtualenv</a></li>
<li>Quick Start
请移步<a href="http://flask.pocoo.org/docs/quickstart/#quickstart">这里</a> 。我也是跟着快速教程一步一步做的，写出来的服务器也很简单。
毕竟这篇文章的主题不是这个。</li>
</ol>
</div>
</div>
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">2.2</span> Nodejs</h3>
<div class="outline-text-3" id="text-2-2">
<p>
关于如何安装 <a href="http://nodejs.org/">nodejs</a> 以及如何使用我在此不多累述。官方文档写的很详细。
然后我使用的是 <a href="http://expressjs.com/">expressjs</a> 这一WEB框架。安装方式和快速入门点击 <a href="http://expressjs.com/guide.html">QuickStart</a> 。
</p>

<p>
在这里着重写一下使用 <code>coffeescript</code> 来写nodejs的代码。
具体可以看这篇文章：<a href="http://sparklinlabs.com/2013/06/my-node-js-express-coffeescript-setup/">My Node.js Express + CoffeeScript setup</a>
</p>

<p>
我的做法只是用来其中的一条命令：
</p>
<div class="org-src-container">

<pre class="src src-sh">$ sudo npm install -g js2coffee
</pre>
</div>
<p>
将express生成的app.js转成了app.coffee，然后将 package.json 中的
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #8abeb7;">"start"</span>: <span style="color: #8abeb7;">"node app.js"</span>
</pre>
</div>
<p>
变成了：
</p>
<div class="org-src-container">

<pre class="src src-js"><span style="color: #8abeb7;">"start"</span>: <span style="color: #8abeb7;">"coffee app.coffee"</span>
</pre>
</div>

<p>
具体的在我上面提到文章中有详细介绍。当然还可以看看这个：<a href="http://twilson63.github.io/express-coffee/">Express-coffee</a>
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-2">
<h2 id="orgheadline5"><span class="section-number-2">3</span> Polling</h2>
<div class="outline-text-2" id="text-3">
<p>
这是轮询的方式，是一种很常见的解决方案。然后我这里没有写代码。
思路就是使用setInterval()函数，定时访问服务器。构成一个一个polling.
</p>
</div>
</div>
<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> Comet</h2>
<div class="outline-text-2" id="text-4">
<p>
等待填坑……
</p>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">5</span> Long Polling</h2>
<div class="outline-text-2" id="text-5">
<p>
长轮询方式。
代码：
</p>
<script src="https://gist.github.com/creamidea/6114508.js"></script>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-2">
<h2 id="orgheadline8"><span class="section-number-2">6</span> WebSocket</h2>
<div class="outline-text-2" id="text-6">
<p>
等待填坑……
</p>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-2">
<h2 id="orgheadline9"><span class="section-number-2">7</span> Socket.IO</h2>
<div class="outline-text-2" id="text-7">
<p>
<b><b>Socket.IO</b></b> 这个我个人感觉不错，支持的浏览器也很多，然后使用的是nodejs。
有空的时候看看源代码，看看究竟是如何实现的。
</p>

<p>
然后下面的代码都是按照官方的步骤做的，只是稍微修改了一下。具体的可以参照 <a href="http://socket.io/#how-to-use">这里</a>
</p>

<p>
代码：
</p>
<script src="https://gist.github.com/creamidea/6114473.js"></script>
</div>
</div>

<div id="outline-container-orgheadline10" class="outline-2">
<h2 id="orgheadline10"><span class="section-number-2">8</span> 后记</h2>
<div class="outline-text-2" id="text-8">
<p>
然后接下来需要思考的是数据库更新，如何通知web服务器发送更新数据？
继续等待填坑……
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="meta-article"><p class="author">Junjia Ni</p>
<p class="email"><a href="mailto:creamidea@gmail.com">creamidea@gmail.com</a></p>
<p class="date">2013-07-30</p>
<p class="export-date">2016-11-07 Mon 15:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.6)</p>
<p class="validation"></p>
<p class="last-modification-time">2016-10-23 Sun 23:09</p></div><script src="/static/article.js"></script><!-- Google Analytics --><script>(function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');ga('create', 'UA-38213594-1', 'auto');ga('send', 'pageview');</script><!-- End Google Analytics -->
</div>
</body>
</html>
